src/DocumentJournals/уатЭлектронныеПеревозочныеДокументы/уатЭлектронныеПеревозочныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>уатЭлектронныеПеревозочныеДокументы</name>
  <registeredDocuments>Document.ЭлектроннаяСопроводительнаяВедомость</registeredDocuments>
  <registeredDocuments>Document.ЭлектроннаяТранспортнаяНакладная</registeredDocuments>
  <registeredDocuments>Document.ЭлектронныйЗаказНаряд</registeredDocuments>
  <registeredDocuments>Document.ЭлектронныйПутевойЛист</registeredDocuments>
  <registeredDocuments>Document.ЭлектронныйДоговорФрахтования</registeredDocuments>
  <registeredDocuments>Document.ЭлектронныйЗаказЗаявка</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
</mdclass:DocumentJournal>

src/InformationRegisters/уатСвязанныеДокументыЭПД/уатСвязанныеДокументыЭПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатСвязанныеДокументыЭПД</name>
  <comment>(уат)</comment>
  <resources>
    <name>QR</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭПД</name>
    <type>
      <types>DocumentRef.ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.ЭлектронныйПутевойЛист</types>
      <types>DocumentRef.ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.ЭлектроннаяСопроводительнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаТС</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.уатМаршрутныйЛист</types>
      <types>DocumentRef.уатПутевойЛист</types>
      <types>DocumentRef.уатЗаказПеревозчику_уэ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/уатЗаказПеревозчику_уэ/уатЗаказПеревозчику_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатЗаказПеревозчику_уэ</name>
  <basedOn>Document.уатЗаказГрузоотправителя</basedOn>
  <basedOn>Document.уатСчетНаОплатуПоставщика</basedOn>
  <basedOn>Document.уатМаршрутныйЛист</basedOn>
  <basedOn>Document.уатТендер_уэ</basedOn>
  <registerRecords>AccumulationRegister.уатПлановыеУслуги_уэ</registerRecords>
  <registerRecords>AccumulationRegister.уатПредоставленныеУслуги</registerRecords>
  <registerRecords>AccumulationRegister.уатРасходы</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <comment>Номер входящего документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.уатМаршрутныйЛист</types>
      <types>DocumentRef.уатТендер_уэ</types>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
      <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <comment>Суммарное количество мест груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ) Курс валюты взаиморасчетов по договору</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.уатМаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп1</name>
    <type>
      <types>CatalogRef.уатТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <type>
      <types>CatalogRef.уатТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>CatalogRef.уатСтатусы_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоянка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.уатТС</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрузовоеМесто</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.уатГрузовыеМеста_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.уатВидыУпаковки_уэ</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>CatalogRef.уатТипыКонтейнеров_уэ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
          <scale>10</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
          <scale>10</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.уатСтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлан</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПлан</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>CatalogRef.уатТарифыТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПлан</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выработка</name>
    <comment>Выработка по пользовательским параметрам.Используется для расчета по тарифам на услуги</comment>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>CatalogRef.уатПараметрыВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
          <scale>10</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиУведомлений</name>
    <attributes>
      <name>ВидУведомления</name>
      <type>
        <types>CatalogRef.уатСпособыВзаимодействий_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Контрагенты</types>
        <types>String</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПолучателя</name>
      <type>
        <types>EnumRef.уатТипыПолучателейУведомлений_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПосылатьУведомления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DocumentJournals/уатЭлектронныеПеревозочныеДокументы/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ФормаПодбораЭПД_Выбор" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	КлючиСтрок = Строки.ПолучитьКлючи();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("массивЭПД", КлючиСтрок);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	уатСвязанныеДокументыЭПД.ЗаказНаТС КАК СвязанныйДокумент,
	               |	уатСвязанныеДокументыЭПД.ЭПД КАК ЭПД
	               |ИЗ
	               |	РегистрСведений.уатСвязанныеДокументыЭПД КАК уатСвязанныеДокументыЭПД
	               |ГДЕ
	               |	уатСвязанныеДокументыЭПД.ЭПД В(&массивЭПД)
	               |	И уатСвязанныеДокументыЭПД.ЗаказНаТС <> НЕОПРЕДЕЛЕНО
	               |	И уатСвязанныеДокументыЭПД.ЗаказНаТС <> ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	               |	И НЕ уатСвязанныеДокументыЭПД.ЗаказНаТС ЕСТЬ NULL 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	уатСвязанныеДокументыЭПД.Рейс,
	               |	уатСвязанныеДокументыЭПД.ЭПД
	               |ИЗ
	               |	РегистрСведений.уатСвязанныеДокументыЭПД КАК уатСвязанныеДокументыЭПД
	               |ГДЕ
	               |	уатСвязанныеДокументыЭПД.ЭПД В(&массивЭПД)
	               |	И уатСвязанныеДокументыЭПД.Рейс <> НЕОПРЕДЕЛЕНО
	               |	И уатСвязанныеДокументыЭПД.Рейс <> ЗНАЧЕНИЕ(Документ.уатМаршрутныйЛист.ПустаяСсылка)
	               |	И уатСвязанныеДокументыЭПД.Рейс <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка) 
	               |	И уатСвязанныеДокументыЭПД.Рейс <> ЗНАЧЕНИЕ(Документ.уатЗаказПеревозчику_уэ.ПустаяСсылка)
	               |	И НЕ уатСвязанныеДокументыЭПД.Рейс ЕСТЬ NULL";  
	Основания = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		Данные  = ТекущаяСтрока.Значение.Данные;
		ОтборЭД = Новый Структура("ЭПД", Данные.Ссылка);
		ОснованияЭД = Основания.НайтиСтроки(ОтборЭД); 
		
		Представление = "";
		КоличествоОснований = ОснованияЭД.Количество();
		Если КоличествоОснований = 0 Тогда  
			Представление = "";
		ИначеЕсли КоличествоОснований = 1 Тогда
			Представление = Строка(ОснованияЭД[0].СвязанныйДокумент);
			Данные.СвязанныйДокументИзображение = 3;
		Иначе
			ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'");
			Представление = СтрокаСЧислом(ШаблонСтроки, КоличествоОснований, ВидЧисловогоЗначения.Количественное);
			Данные.СвязанныйДокументИзображение = 3;
		КонецЕсли;  
		Данные.СвязанныйДокумент            = Представление;
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПредставлениеСостояния Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ИначеЕсли Поле = Элементы.СвязанныйДокумент Тогда 
		СтандартнаяОбработка = Ложь;
		
		ДокументыОснования = ПолучитьДокументыОснования(ВыбраннаяСтрока);
		Если ДокументыОснования.Количество() = 1 Тогда
			ПоказатьЗначение(Неопределено, ДокументыОснования[0].ДокументОснование);
		ИначеЕсли ДокументыОснования.Количество() > 1 Тогда
			ПараметрыФормы = Новый Структура;
			
			МассивДокументов = Новый Массив;
			Для Каждого СтрТаб Из ДокументыОснования Цикл
				МассивДокументов.Добавить(СтрТаб.ДокументОснование);	
			КонецЦикла;
			
			ПараметрыФормы.Вставить("МассивДокументов", МассивДокументов); 
			
			ОписаниеДокументыОснование_Закрытие = Новый ОписаниеОповещения("ДокументыОснование_Закрытие", ЭтотОбъект);

			ОткрытьФорму("Документ.ЭлектроннаяТранспортнаяНакладная.Форма.ДокументыОснования",
			ПараметрыФормы, ЭтотОбъект,,,,ОписаниеДокументыОснование_Закрытие,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДокументыОснования(Ссылка)
	
	МассивДокументов = Новый Массив();

	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная") Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ЭлектроннаяТранспортнаяНакладная.ДокументыОснования КАК ЭлектроннаяТранспортнаяНакладнаяДокументыОснования
		|ГДЕ
		|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка = &Ссылка"; 
	Иначе
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЭлектронныйПутевойЛистДокументыОснования.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ЭлектронныйПутевойЛист.ДокументыОснования КАК ЭлектронныйПутевойЛистДокументыОснования
		|ГДЕ
		|	ЭлектронныйПутевойЛистДокументыОснования.Ссылка = &Ссылка"; 
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДокументов.Добавить(Новый Структура("ДокументОснование", Выборка.ДокументОснование));
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура ДокументыОснование_Закрытие(Результат, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДокументыОснование_ЗакрытиеСервер(ТекущиеДанные.Ссылка, Результат, ДополнительныеПараметры);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДокументыОснование_ЗакрытиеСервер(ЭТрн, Результат, ДополнительныеПараметры)

	Если ТипЗнч(Результат) = Тип("Массив") Тогда   
		ДокОбъект = ЭТрн.ПолучитьОбъект();
		ДокОбъект.ДокументыОснования.Очистить();
		Для Каждого Документ Из Результат Цикл
			НовСтр = ДокОбъект.ДокументыОснования.Добавить();	
			НовСтр.ДокументОснование = Документ;	
		КонецЦикла;
		Попытка
			ДокОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
